stat_cef = {"체력":400 / 150, "방어":300 / 15,\
     "마저":450/25, "체젠":150/50, "마젠":250/50, \
     "공속":300/12, "마나":350/250, "공격력":350/10,\
     "주문력":435/20, "치명타":600/15, "힐실드":550/10,\
     "이속":300/25, "흡혈":37.5, "물관":5, "방관%":37.5,\
     "마관":(1100-12*45)/18, "마관%":(1250-25*435/20)/15,\
     "가속":26.5, "이속%":(850-30*435/20)/5,\
     "적중시추가피해":25,\
     "전체흡혈":(1300-250*400/150-20*435/20)/5}
while True:
    stat = []
    while True:
        new = input("스탯명:수치(없으면 빈칸) ")
        if new == "":
            break
        stat.append(new)
    status = []
    for tus in stat:
        status.append(tus.split(":"))

    print(status)
    add = 0

    for each in status:
        add += stat_cef[each[0]] * float(each[1])

    print(add)